In [33]:
import numpy as np
import pandas as pd

# Dictionary

In [68]:
fd = pd.DataFrame({'a': [4,7,10], 'b': [5,8,11],'c':[6,9,12]},index=pd.MultiIndex.from_tuples([('d',1),('d',2),('e',3)],names=['n','v']))

In [69]:
fd

      a   b   c
n v
d 1   4   5   6
  2   7   8   9
e 3  10  11  12

In [50]:
df = pd.Series([1,2,3,4,5],index=[4,5,6,7,8])

In [51]:
df

4    1
5    2
6    3
7    4
8    5
dtype: int64

In [77]:
fd1 = pd.DataFrame([[4,7,10],[5,8,11],[6,'hero',12]],index=[1,2,3],columns=['e','r','t'])

In [78]:
fd1

   e     r   t
1  4     7  10
2  5     8  11
3  6  hero  12

In [79]:
fd2 = pd.DataFrame({'a': [4,7,10], 'b': [5,8,11],'c':[6,9,12]},index=[1,2,3])

In [80]:
fd2

    a   b   c
1   4   5   6
2   7   8   9
3  10  11  12

In [81]:
fd2.head(2)

   a  b  c
1  4  5  6
2  7  8  9

In [82]:
fd2.tail(2)

    a   b   c
2   7   8   9
3  10  11  12

In [83]:
pd.melt(fd2)

  variable  value
0        a      4
1        a      7
2        a     10
3        b      5
4        b      8
5        b     11
6        c      6
7        c      9
8        c     12

In [84]:
pd.concat([fd,fd1],axis=0)

           a     b     c    e     r     t
(d, 1)   4.0   5.0   6.0  NaN   NaN   NaN
(d, 2)   7.0   8.0   9.0  NaN   NaN   NaN
(e, 3)  10.0  11.0  12.0  NaN   NaN   NaN
1        NaN   NaN   NaN  4.0     7  10.0
2        NaN   NaN   NaN  5.0     8  11.0
3        NaN   NaN   NaN  6.0  hero  12.0

In [85]:
pd.concat([fd,fd2],axis=0)

         a   b   c
(d, 1)   4   5   6
(d, 2)   7   8   9
(e, 3)  10  11  12
1        4   5   6
2        7   8   9
3       10  11  12

In [86]:
pd.concat([fd2,fd1],axis=1)

    a   b   c  e     r   t
1   4   5   6  4     7  10
2   7   8   9  5     8  11
3  10  11  12  6  hero  12

In [91]:
fd2.sort_values('a',ascending=False)

    a   b   c
3  10  11  12
2   7   8   9
1   4   5   6